In [ ]:
# 정렬과 순위

In [6]:
import pandas as pd
import numpy as np

In [7]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [3]:
# 로우나 컬럼의 색인을 순서대로 정렬한다.
a = obj.sort_index()

In [4]:
a

a    1
b    2
c    3
d    0
dtype: int64

In [8]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'], 
                     columns = ['d', 'a', 'b', 'c'] )

In [9]:
# axis=0, 로우로 정렬
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [10]:
# axis=1, 컬럼으로 정렬
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [14]:
#객체를 값(value)에 따라 정렬
a = obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [16]:
# sort_index(), sort_values()를 섞어 사용하여, 색인, 값(value)를 순서대로 정렬할 수 있다.
b = a.sort_index()
b

a    1
b    2
c    3
d    0
dtype: int64

In [18]:
frame = pd.DataFrame({'b': [4,7,-3,2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [20]:
frame.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [19]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [21]:
# 2개의 컬럼 한 번에 정렬
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [ ]:
# 5.2.8 중복 색인

In [25]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [26]:
# 색인이 유일한 지 유무 확인
obj.index.is_unique

False